In [2]:
import numpy as np
import pandas as pd

SERİLER

In [3]:
sozluk = {"Ali":40, "Veli": 30, "Ayşe": 20, "Fatma": 10}

In [4]:
pd.Series(sozluk)

Ali      40
Veli     30
Ayşe     20
Fatma    10
dtype: int64

In [5]:
type(pd.Series(sozluk))

pandas.core.series.Series

In [6]:
yaslar = [40,30,20,10]
isimler = ["Ali", "Veli", "Ayşe", "Fatma"]

In [7]:
pd.Series(yaslar, index=isimler)

Ali      40
Veli     30
Ayşe     20
Fatma    10
dtype: int64

In [8]:
pd.Series(data = yaslar , index=isimler)

Ali      40
Veli     30
Ayşe     20
Fatma    10
dtype: int64

In [9]:
pd.Series(yaslar,isimler)

Ali      40
Veli     30
Ayşe     20
Fatma    10
dtype: int64

In [10]:
numpyDizisi = np.array(yaslar)
pd.Series(numpyDizisi)

0    40
1    30
2    20
3    10
dtype: int64

In [11]:
pd.Series(numpyDizisi, isimler)

Ali      40
Veli     30
Ayşe     20
Fatma    10
dtype: int64

In [12]:
yarismaSonucu1 = pd.Series([1,2,3],["Ali", "Veli", "Ayşe",])

In [13]:
print(yarismaSonucu1)

Ali     1
Veli    2
Ayşe    3
dtype: int64

In [14]:
yarismaSonucu2 = pd.Series([30,25,18],["Ali", "Veli", "Ayşe",])

In [15]:
print(yarismaSonucu2)

Ali     30
Veli    25
Ayşe    18
dtype: int64

In [16]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2
sonSonuc

Ali     31
Veli    27
Ayşe    21
dtype: int64

In [17]:
farkliSeries = pd.Series([1,2,3,4],["a", "b", "c","d"])

In [18]:
farkliSeries2 = pd.Series([5,6,7,8],["a", "f", "g","c"])

In [19]:
sonSeries = farkliSeries + farkliSeries2
sonSeries

a     6.0
b     NaN
c    11.0
d     NaN
f     NaN
g     NaN
dtype: float64

DATAFRAME PANDAS

In [20]:
data = np.random.randn(4,3)

In [21]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.774761  0.084498  1.976712
1  0.004374 -1.082069  0.622864
2 -0.180389 -0.248134 -0.642238
3 -1.147360  0.831503 -0.527975

In [22]:
dataFrame[0]

0    0.774761
1    0.004374
2   -0.180389
3   -1.147360
Name: 0, dtype: float64

In [23]:
type(dataFrame)

pandas.core.frame.DataFrame

In [24]:
yeniDataFrame = pd.DataFrame(data,index=["a","b","c","d"],columns=["A","B","C"])
yeniDataFrame

          A         B         C
a  0.774761  0.084498  1.976712
b  0.004374 -1.082069  0.622864
c -0.180389 -0.248134 -0.642238
d -1.147360  0.831503 -0.527975

In [25]:
yeniDataFrame["A"]

a    0.774761
b    0.004374
c   -0.180389
d   -1.147360
Name: A, dtype: float64

In [26]:
yeniDataFrame.loc["a"]

A    0.774761
B    0.084498
C    1.976712
Name: a, dtype: float64

In [27]:
yeniDataFrame.iloc[1]

A    0.004374
B   -1.082069
C    0.622864
Name: b, dtype: float64

In [28]:
yeniDataFrame["D"] = yeniDataFrame["B"] + yeniDataFrame["B"]

In [29]:
yeniDataFrame

          A         B         C         D
a  0.774761  0.084498  1.976712  0.168997
b  0.004374 -1.082069  0.622864 -2.164137
c -0.180389 -0.248134 -0.642238 -0.496268
d -1.147360  0.831503 -0.527975  1.663006

In [30]:
yeniDataFrame["E"] = (15,30,45,60)

In [31]:
yeniDataFrame["F"] = [1,2,3,4]

In [32]:
yeniDataFrame

          A         B         C         D   E  F
a  0.774761  0.084498  1.976712  0.168997  15  1
b  0.004374 -1.082069  0.622864 -2.164137  30  2
c -0.180389 -0.248134 -0.642238 -0.496268  45  3
d -1.147360  0.831503 -0.527975  1.663006  60  4

In [33]:
yeniDataFrame.drop("F",axis=1)

          A         B         C         D   E
a  0.774761  0.084498  1.976712  0.168997  15
b  0.004374 -1.082069  0.622864 -2.164137  30
c -0.180389 -0.248134 -0.642238 -0.496268  45
d -1.147360  0.831503 -0.527975  1.663006  60

In [34]:
yeniDataFrame.drop("d",axis=0)

          A         B         C         D   E  F
a  0.774761  0.084498  1.976712  0.168997  15  1
b  0.004374 -1.082069  0.622864 -2.164137  30  2
c -0.180389 -0.248134 -0.642238 -0.496268  45  3

In [35]:
yeniDataFrame

          A         B         C         D   E  F
a  0.774761  0.084498  1.976712  0.168997  15  1
b  0.004374 -1.082069  0.622864 -2.164137  30  2
c -0.180389 -0.248134 -0.642238 -0.496268  45  3
d -1.147360  0.831503 -0.527975  1.663006  60  4

In [36]:
yeniDataFrame.drop("F",axis=1,inplace=True)

In [37]:
yeniDataFrame

          A         B         C         D   E
a  0.774761  0.084498  1.976712  0.168997  15
b  0.004374 -1.082069  0.622864 -2.164137  30
c -0.180389 -0.248134 -0.642238 -0.496268  45
d -1.147360  0.831503 -0.527975  1.663006  60

In [38]:
yeniDataFrame.loc["a"]["B"]

np.float64(0.08449834244778454)

In [39]:
booleanFrame = yeniDataFrame < 0

In [40]:
booleanFrame

       A      B      C      D      E
a  False  False  False  False  False
b  False   True  False   True  False
c   True   True   True   True  False
d   True  False   True  False  False

In [41]:
yeniDataFrame[booleanFrame]

          A         B         C         D   E
a       NaN       NaN       NaN       NaN NaN
b       NaN -1.082069       NaN -2.164137 NaN
c -0.180389 -0.248134 -0.642238 -0.496268 NaN
d -1.147360       NaN -0.527975       NaN NaN

In [42]:
yeniDataFrame[yeniDataFrame < 0]

          A         B         C         D   E
a       NaN       NaN       NaN       NaN NaN
b       NaN -1.082069       NaN -2.164137 NaN
c -0.180389 -0.248134 -0.642238 -0.496268 NaN
d -1.147360       NaN -0.527975       NaN NaN

In [43]:
yeniDataFrame["C"] > 0

a     True
b     True
c    False
d    False
Name: C, dtype: bool

In [44]:
yeniDataFrame[yeniDataFrame["C"] > 0]

          A         B         C         D   E
a  0.774761  0.084498  1.976712  0.168997  15
b  0.004374 -1.082069  0.622864 -2.164137  30

In [45]:
yeniDataFrame[yeniDataFrame["B"] > 0]

          A         B         C         D   E
a  0.774761  0.084498  1.976712  0.168997  15
d -1.147360  0.831503 -0.527975  1.663006  60

In [46]:
yeniDataFrame

          A         B         C         D   E
a  0.774761  0.084498  1.976712  0.168997  15
b  0.004374 -1.082069  0.622864 -2.164137  30
c -0.180389 -0.248134 -0.642238 -0.496268  45
d -1.147360  0.831503 -0.527975  1.663006  60

In [47]:
yeniDataFrame.reset_index()

  index         A         B         C         D   E
0     a  0.774761  0.084498  1.976712  0.168997  15
1     b  0.004374 -1.082069  0.622864 -2.164137  30
2     c -0.180389 -0.248134 -0.642238 -0.496268  45
3     d -1.147360  0.831503 -0.527975  1.663006  60

In [48]:
yeniIndexListesi =  ["T","L","Y","B"]

In [49]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [50]:
yeniDataFrame

          A         B         C         D   E Yeni Index
a  0.774761  0.084498  1.976712  0.168997  15          T
b  0.004374 -1.082069  0.622864 -2.164137  30          L
c -0.180389 -0.248134 -0.642238 -0.496268  45          Y
d -1.147360  0.831503 -0.527975  1.663006  60          B

In [51]:
yeniDataFrame.set_index("Yeni Index" ,inplace = True)

In [52]:
yeniDataFrame

                   A         B         C         D   E
Yeni Index
T           0.774761  0.084498  1.976712  0.168997  15
L           0.004374 -1.082069  0.622864 -2.164137  30
Y          -0.180389 -0.248134 -0.642238 -0.496268  45
B          -1.147360  0.831503 -0.527975  1.663006  60

In [53]:
yeniDataFrame.loc["T"]

A     0.774761
B     0.084498
C     1.976712
D     0.168997
E    15.000000
Name: T, dtype: float64

MULTI INDEX

In [54]:
disIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [55]:
icIndexler = ["Honner","Bart","Marge","Cartman","Kenny","Kyle"]

In [56]:
birlesmisIndex = list(zip(disIndexler,icIndexler))

In [57]:
birlesmisIndex

[('Simpson', 'Honner'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [58]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [59]:
birlesmisIndex

MultiIndex([(   'Simpson',  'Honner'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [60]:
cizgiFilmListe = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [61]:
cizgiFilmListeNumpy = np.array(cizgiFilmListe)

In [62]:
cizgiFilmListeNumpy

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U21')

In [63]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmListeNumpy, index = birlesmisIndex , columns = ["Yaş","Meslek"])

In [64]:
print(cizgiFilmDataFrame)

                   Yaş Meslek
Simpson    Honner   40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [65]:
cizgiFilmDataFrame.loc["Simpson"]

       Yaş Meslek
Honner  40      A
Bart    10      B
Marge   30      C

In [66]:
cizgiFilmDataFrame.iloc[0]

Yaş       40
Meslek     A
Name: (Simpson, Honner), dtype: object

In [67]:
cizgiFilmDataFrame.loc["South Park"]

        Yaş Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [68]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yaş       10
Meslek     E
Name: Kenny, dtype: object

In [69]:
cizgiFilmDataFrame.index.names = ["Çizgifilm Adı" , "Karakter İsim"]

In [70]:
cizgiFilmDataFrame

                            Yaş Meslek
Çizgifilm Adı Karakter İsim
Simpson       Honner         40      A
              Bart           10      B
              Marge          30      C
South Park    Cartman         9      D
              Kenny          10      E
              Kyle           11      F

OPERASYONLAR

In [71]:
sozlukVerisi = {"İstanbul" : [30,29,25], "İzmir" : [31,np.nan,25] , "Konya" : [np.nan,28,31]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [72]:
havaDurumuDataFrame

   İstanbul  İzmir  Konya
0        30   31.0    NaN
1        29    NaN   28.0
2        25   25.0   31.0

In [73]:
havaDurumuDataFrame.index.names = ["Hava Sıcaklığı"]

In [74]:
havaDurumuDataFrame

                İstanbul  İzmir  Konya
Hava Sıcaklığı
0                     30   31.0    NaN
1                     29    NaN   28.0
2                     25   25.0   31.0

In [75]:
havaDurumuDataFrame.index = ['1. Gün', '2. Gün', '3. Gün']
havaDurumuDataFrame

        İstanbul  İzmir  Konya
1. Gün        30   31.0    NaN
2. Gün        29    NaN   28.0
3. Gün        25   25.0   31.0

In [76]:
havaDurumuDataFrame.dropna()

        İstanbul  İzmir  Konya
3. Gün        25   25.0   31.0

In [77]:
havaDurumuDataFrame.dropna(axis=1)

        İstanbul
1. Gün        30
2. Gün        29
3. Gün        25

In [78]:
sozlukVerisi2 = {"İstanbul" : [30,29,25], "İzmir" : [31,np.nan,np.nan] , "Konya" : [np.nan,28,31]}
havaDurumuDataFrame2 = pd.DataFrame(sozlukVerisi2)

In [79]:
havaDurumuDataFrame2

   İstanbul  İzmir  Konya
0        30   31.0    NaN
1        29    NaN   28.0
2        25    NaN   31.0

In [80]:
havaDurumuDataFrame2.index.names = ["Hava Sıcaklığı"]

In [81]:
havaDurumuDataFrame2.index = ["1.Gün" , "2.Gün" , "3.Gün"]

In [82]:
havaDurumuDataFrame2

       İstanbul  İzmir  Konya
1.Gün        30   31.0    NaN
2.Gün        29    NaN   28.0
3.Gün        25    NaN   31.0

In [83]:
havaDurumuDataFrame2.dropna(axis=1,thresh=2) 
#thresh=2 parametresi ise bir sütunun en az 2 tane geçerli (NaN olmayan) değer içermesi gerektiğini belirtir.
havaDurumuDataFrame2

       İstanbul  İzmir  Konya
1.Gün        30   31.0    NaN
2.Gün        29    NaN   28.0
3.Gün        25    NaN   31.0

In [84]:
havaDurumuDataFrame2.fillna(10)

       İstanbul  İzmir  Konya
1.Gün        30   31.0   10.0
2.Gün        29   10.0   28.0
3.Gün        25   10.0   31.0

GROUPBY

In [85]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Satış","Satış","Pazarlama","Pazarlama"],"Çalışan İsmi" : ["Sueda","Hilal","Zeynep","Mina","Lidya","Esin"],"Maaş(bin)" : [125,155,145,150,95,105]}

In [86]:
maasBilgisi = pd.DataFrame(maasSozlugu)

In [87]:
maasBilgisi

   Departman Çalışan İsmi  Maaş(bin)
0    Yazılım        Sueda        125
1    Yazılım        Hilal        155
2      Satış       Zeynep        145
3      Satış         Mina        150
4  Pazarlama        Lidya         95
5  Pazarlama         Esin        105

In [88]:
maasBilgisi.index.names = ["Departman No."]
maasBilgisi.index = [404,404,255,255,257,257]
display(maasBilgisi)

     Departman Çalışan İsmi  Maaş(bin)
404    Yazılım        Sueda        125
404    Yazılım        Hilal        155
255      Satış       Zeynep        145
255      Satış         Mina        150
257  Pazarlama        Lidya         95
257  Pazarlama         Esin        105

In [89]:
grupObjesi = maasBilgisi.groupby("Departman")
grupObjesi

In [90]:
grupObjesi.count()

           Çalışan İsmi  Maaş(bin)
Departman
Pazarlama             2          2
Satış                 2          2
Yazılım               2          2

In [91]:
grupObjesi[["Maaş(bin)"]].mean()

           Maaş(bin)
Departman
Pazarlama      100.0
Satış          147.5
Yazılım        140.0

In [92]:
grupObjesi["Maaş(bin)"].min()

Departman
Pazarlama     95
Satış        145
Yazılım      125
Name: Maaş(bin), dtype: int64

In [93]:
grupObjesi["Maaş(bin)"].max()

Departman
Pazarlama    105
Satış        150
Yazılım      155
Name: Maaş(bin), dtype: int64

In [94]:
grupObjesi["Maaş(bin)"].describe()

           count   mean        std    min     25%    50%     75%    max
Departman
Pazarlama    2.0  100.0   7.071068   95.0   97.50  100.0  102.50  105.0
Satış        2.0  147.5   3.535534  145.0  146.25  147.5  148.75  150.0
Yazılım      2.0  140.0  21.213203  125.0  132.50  140.0  147.50  155.0

CONCATENATION

In [95]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],"Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],"Kalori" : [200,250,150,300]}
liste1 = pd.DataFrame(sozluk1)

In [96]:
liste1.index = ["1.Kişi","2.Kişi","3.Kişi","4.Kişi"]
liste1

          Isim       Spor  Kalori
1.Kişi   Ahmet       Koşu     200
2.Kişi  Mehmet      Yüzme     250
3.Kişi  Zeynep       Koşu     150
4.Kişi    Atıl  Basketbol     300

In [97]:
sozluk2 = {"Isim" : ["Ayşe","Melek","Zeki","Aslı"],"Spor" : ["Baketbol","Koşu","Koşu","Yüzme"],"Kalori" : [250,150,200,100]}
liste2 = pd.DataFrame(sozluk1)

In [119]:
liste2.index = ["5.Kişi","6.Kişi","7.Kişi","8.Kişi"]
liste2

          Isim       Spor  Kalori
5.Kişi   Ahmet       Koşu     200
6.Kişi  Mehmet      Yüzme     250
7.Kişi  Zeynep       Koşu     150
8.Kişi    Atıl  Basketbol     300

In [99]:
sozluk3 = {"Isim" : ["Bengü","Rabia","Sümeyye","Perihan"],"Spor" : ["Baketbol","Voleybol","Voleybol","Voleybol"],"Kalori" : [250,200,200,200]}
liste3 = pd.DataFrame(sozluk1)

In [118]:
liste3.index = ["9.Kişi","10.Kişi","11.Kişi","12.Kişi"]
liste3

           Isim       Spor  Kalori
9.Kişi    Ahmet       Koşu     200
10.Kişi  Mehmet      Yüzme     250
11.Kişi  Zeynep       Koşu     150
12.Kişi    Atıl  Basketbol     300

In [120]:
pd.concat([liste1,liste2,liste3])

           Isim       Spor  Kalori
1.Kişi    Ahmet       Koşu     200
2.Kişi   Mehmet      Yüzme     250
3.Kişi   Zeynep       Koşu     150
4.Kişi     Atıl  Basketbol     300
5.Kişi    Ahmet       Koşu     200
6.Kişi   Mehmet      Yüzme     250
7.Kişi   Zeynep       Koşu     150
8.Kişi     Atıl  Basketbol     300
9.Kişi    Ahmet       Koşu     200
10.Kişi  Mehmet      Yüzme     250
11.Kişi  Zeynep       Koşu     150
12.Kişi    Atıl  Basketbol     300

MERGE

In [102]:
sozluk4 = {"isim" : ["Ayşe","Ali","Fatma","Zeynep"],"spor":["Koşu","Yüzme","Voleybol","Basketbol"]}

liste4 = pd.DataFrame(sozluk4)

liste4.index = ["1.Kişi","2.Kişi","3.Kişi","4.Kişi"]

liste4

          isim       spor
1.Kişi    Ayşe       Koşu
2.Kişi     Ali      Yüzme
3.Kişi   Fatma   Voleybol
4.Kişi  Zeynep  Basketbol

In [103]:
sozluk5 = {"isim" : ["Ayşe","Ali","Fatma","Zeynep"],"Kalori":["250","200","200","300"]}

liste5 = pd.DataFrame(sozluk5)

liste5.index = ["1.Kişi","2.Kişi","3.Kişi","4.Kişi"]

liste5

          isim Kalori
1.Kişi    Ayşe    250
2.Kişi     Ali    200
3.Kişi   Fatma    200
4.Kişi  Zeynep    300

In [104]:
pd.merge(liste4,liste5,on = "isim")

     isim       spor Kalori
0    Ayşe       Koşu    250
1     Ali      Yüzme    200
2   Fatma   Voleybol    200
3  Zeynep  Basketbol    300

PANDAS İLERİ OPERASYONLAR

In [105]:
maasSozlugu = {"Çalışan İsmi" : ["Atıl","Zeynep","Mehmet","Ahmet"],"Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],"Maaş" : [125,155,145,150]}
maasDataFrame = pd.DataFrame(maasSozlugu)

In [106]:
maasDataFrame.index.names = ["Çalışanlar"]

In [107]:
maasDataFrame

           Çalışan İsmi  Departman  Maaş
Çalışanlar
0                  Atıl    Yazılım   125
1                Zeynep      Satış   155
2                Mehmet  Pazarlama   145
3                 Ahmet    Yazılım   150

In [121]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [122]:
maasDataFrame["Departman"].nunique()

3

In [110]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [111]:
def bruttenNete(maas) :
    return maas * 0.66

In [112]:
maasDataFrame["Maaş"].apply(bruttenNete)

Çalışanlar
0     82.5
1    102.3
2     95.7
3     99.0
Name: Maaş, dtype: float64

In [113]:
maasBilgisi.isnull()

     Departman  Çalışan İsmi  Maaş(bin)
404      False         False      False
404      False         False      False
255      False         False      False
255      False         False      False
257      False         False      False
257      False         False      False

PIVOT TABLE

In [114]:
yeniBirVeri = {"karakter sınıfı" :["south park","south park","simpson","simpson","simpson"],"karakter ismi":["cartman","kenny","honner","bart","bart"],"karakter yas" :[9,10,50,20,10]}
karakterDF = pd.DataFrame(yeniBirVeri)

In [115]:
karakterDF.index.names = ["karakterler"]

In [116]:
karakterDF

            karakter sınıfı karakter ismi  karakter yas
karakterler
0                south park       cartman             9
1                south park         kenny            10
2                   simpson        honner            50
3                   simpson          bart            20
4                   simpson          bart            10

In [117]:
karakterDF.pivot_table(values = "karakter yas", index = ["karakter sınıfı","karakter ismi"],aggfunc=np.sum)

C:\Users\ebeng\AppData\Local\Temp\ipykernel_5540\2947203609.py:1: FutureWarning: The provided callable <function sum at 0x00000232321635B0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "karakter yas", index = ["karakter sınıfı","karakter ismi"],aggfunc=np.sum)

                               karakter yas
karakter sınıfı karakter ismi
simpson         bart                     30
                honner                   50
south park      cartman                   9
                kenny                    10